frogkim/storage/ARM assembly language/BlingBling/EFR32MG12.inc
; Peripheral base addresses
PRS		EQU	0x400E6000	; Peripheral Reflex System
RMU		EQU	0x400E5000 	; Reset Management Unit
CMU		EQU	0x400E4000	; Clock Management Unit
EMU		EQU	0x400E3000	; Energy Management Unit
LDMA		EQU	0x400E2000 	; Linked Direct Memory Access 
FPUEH		EQU	0x400E1000	;
MSC		EQU	0x400E0000	; Memory System Controller
LESENSE		EQU	0x40055000 	; Low Enegry Sensor Interface
WDOG1		EQU	0x40052400 	; Watchdog Timer1
WDOG0		EQU	0x40052000	; Watchdog Timer0
PCNT2		EQU	0x4004E800	; Pulse Counter2
PCNT1		EQU	0x4004E400	; Pulse Counter1
PCNT0		EQU	0x4004E000	; Pulse Counter0
LEUART0		EQU	0x4004A000 	; Low Enegry UART
LETIMER0	EQU	0x40046000 	; Low Energy Timer
RTCC		EQU	0x40042000 	; Real Time Clock
SMU		EQU	0x40022000
CSEN		EQU	0x4001F000
CRYOTIMER	EQU	0x4001E000
TRNG0		EQU	0x4001D000	; True Random Number Generator	
GPCRC		EQU	0x4001C000	; CRC engine	
WTIMER1		EQU	0x4001A400 	; TIMER1 module
WTIMER0		EQU	0x4001A000 	; TIMER0 module
TIMER1		EQU	0x40018400	; TIMER1 module
TIMER0		EQU	0x40018000	; TIMER0 module
USART3		EQU	0x40010C00	; USART3 module
USART2		EQU	0x40010800	; USART2 module
USART1		EQU	0x40010400 	; USART1 module
USART0		EQU	0x40010000 	; USART0 module
I2C1		EQU	0x4000C400	; I2C1 module
I2C0		EQU	0x4000C000 	; I2C0 module
GPIO		EQU	0x4000A000 	; GPIO module
VDAC0		EQU	0x40008000 	; DAC0 module
IDAC0		EQU	0x40006000	; Current DAC0 module
ADC0		EQU	0x40002000 	; ADC0 module
ACMP1		EQU	0x40000400 	; Analog comparator 1
ACMP0		EQU	0x40000000 	; Analog Comparator 0


;-------- CMU registers --------------------------------------------------------------------
CMU_CTRL 	EQU	0x000 		; CMU Control Register
CMU_HFRCOCTRL 	EQU 	0x010 		; HFRCO Control Register
CMU_AUXHFRCOCTRL EQU	0x018		; RW AUXHFRCO Control Register
CMU_LFRCOCTRL 	EQU	0x020 		; LFRCO Control Register
CMU_HFXOCTRL 	EQU 	0x024 		; HFXO Control Register
CMU_HFXOSTARTUPCTRL EQU	0x02C 		; HFXO Startup Control
CMU_HFXOSTEADYSTATECTRL EQU 0x030 	; RW HFXO Steady State Control
CMU_HFXOTIMEOUTCTRL EQU	0x034 		; HFXO Timeout Control
CMU_LFXOCTRL 	EQU	0x038 		; LFXO Control Register
CMU_CALCTRL 	EQU	0x050 		; Calibration Control Register
CMU_CALCNT 	EQU	0x054 		; Calibration Counter Register
CMU_OSCENCMD 	EQU	0x060 		; Oscillator Enable/Disable Command Register
CMU_CMD 	EQU	0x064 		; Command Register
CMU_DBGCLKSEL 	EQU	0x070 		; Debug Trace Clock Select
CMU_HFCLKSEL 	EQU	0x074 		; High Frequency Clock Select Command Register
CMU_LFACLKSEL 	EQU	0x080 		; Low Frequency A Clock Select Register
CMU_LFBCLKSEL 	EQU	0x084 		; Low Frequency B Clock Select Register
CMU_LFECLKSEL 	EQU	0x088 		; Low Frequency E Clock Select Register
CMU_STATUS 	EQU	0x090 		; Status Register
CMU_HFCLKSTATUS EQU	0x094 		; HFCLK Status Register
CMU_HFXOTRIMSTATUS EQU	0x09C 		; HFXO Trim Status
CMU_IF 		EQU	0x0A0 		; Interrupt Flag Register
CMU_IFS 	EQU	0x0A4 		; Interrupt Flag Set Register
CMU_IFC 	EQU	0x0A8 		; Interrupt Flag Clear Register
CMU_IEN 	EQU	0x0AC 		; Interrupt Enable Register
CMU_HFBUSCLKEN0 EQU	0x0B0 		; High Frequency Bus Clock Enable Register 0
CMU_HFPERCLKEN0 EQU	0x0C0 		; High Frequency Peripheral Clock Enable Register 0
CMU_HFRADIOALTCLKEN0 EQU 0x0CC 		; High Frequency Alternate Radio Peripheral Clock Enable Register 0
CMU_LFACLKEN0 	EQU	0x0E0 		; Low Frequency a Clock Enable Register 0 (Async Reg)
CMU_LFBCLKEN0 	EQU	0x0E8 		; Low Frequency B Clock Enable Register 0 (Async Reg)
CMU_LFECLKEN0 	EQU	0x0F0 		; Low Frequency E Clock Enable Register 0 (Async Reg)
CMU_HFPRESC 	EQU	0x100 		; High Frequency Clock Prescaler Register
CMU_HFCOREPRESC EQU	0x108 		; High Frequency Core Clock Prescaler Register
CMU_HFPERPRESC 	EQU	0x10C 		; High Frequency Peripheral Clock Prescaler Register
CMU_HFRADIOPRESC EQU	0x110 		; High Frequency Radio Peripheral Clock Prescaler Register
CMU_HFEXPPRESC 	EQU	0x114 		; High Frequency Export Clock Prescaler Register
CMU_LFAPRESC0 	EQU	0x120 		; Low Frequency a Prescaler Register 0 (Async Reg)
CMU_LFBPRESC0 	EQU	0x128 		; Low Frequency B Prescaler Register 0 (Async Reg)
CMU_LFEPRESC0 	EQU	0x130 		; Low Frequency E Prescaler Register 0 (Async Reg)
CMU_HFRADIOALTPRESC EQU 0x138 		; High Frequency Alternate Radio Peripheral Clock Prescaler Register
CMU_SYNCBUSY 	EQU	0x140 		; Synchronization Busy Register
CMU_FREEZE 	EQU	0x144 		; Freeze Register
CMU_PCNTCTRL 	EQU	0x150 		; PCNT Control Register
CMU_ADCCTRL 	EQU	0x15C 		; ADC Control Register
CMU_ROUTEPEN 	EQU	0x170 		; I/O Routing Pin Enable Register
CMU_ROUTELOC0 	EQU	0x174 		; I/O Routing Location Register
CMU_ROUTELOC1 	EQU	0x178 		; I/O Routing Location Register
CMU_LOCK 	EQU	0x180 		; Configuration Lock Register

;-------- EMU registers --------------------------------------------------------------------
EMU_CTRL 	EQU	0x000 		; Control Register
EMU_STATUS 	EQU	0x004 		; Status Register
EMU_LOCK 	EQU	0x008 		; Configuration Lock Register
EMU_RAM0CTRL 	EQU	0x00C 		; Memory Control Register
EMU_CMD 	EQU	0x010 		; Command Register
EMU_EM4CTRL 	EQU	0x018 		; EM4 Control Register
EMU_TEMPLIMITS 	EQU	0x01C 		; Temperature Limits for Interrupt Generation
EMU_TEMP 	EQU	0x020 		; Value of Last Temperature Measurement
EMU_IF 		EQU	0x024 		; Interrupt Flag Register
EMU_IFS 	EQU	0x028 		; Interrupt Flag Set Register
EMU_IFC 	EQU	0x02C 		; Interrupt Flag Clear Register
EMU_IEN 	EQU	0x030 		; Interrupt Enable Register
EMU_PWRLOCK 	EQU	0x034 		; Regulator and Supply Lock Register
EMU_PWRCFG 	EQU	0x038 		; Power Configuration Register
EMU_PWRCTRL 	EQU	0x03C 		; Power Control Register
EMU_DCDCCTRL 	EQU	0x040 		; DCDC Control
EMU_DCDCMISCCTRL EQU	0x04C 		; DCDC Miscellaneous Control Register
EMU_DCDCZDETCTRL EQU	0x050 		; DCDC Power Train NFET Zero Current Detector Control Register
EMU_DCDCCLIMCTRL EQU	0x054 		; DCDC Power Train PFET Current Limiter Control Register
EMU_DCDCLNCOMPCTRL EQU	0x058 		; DCDC Low Noise Compensator Control Register
EMU_DCDCLNVCTRL EQU	0x05C 		; DCDC Low Noise Voltage Register
EMU_DCDCLPVCTRL EQU	0x064 		; DCDC Low Power Voltage Register
EMU_DCDCLPCTRL 	EQU	0x06C 		; DCDC Low Power Control Register
EMU_DCDCLNFREQCTRL EQU	0x070 		; DCDC Low Noise Controller Frequency Control
EMU_DCDCSYNC 	EQU	0x078 		; DCDC Read Status Register
EMU_VMONAVDDCTRL EQU	0x090 		; VMON AVDD Channel Control
EMU_VMONALTAVDDCTRL EQU	0x094 		; Alternate VMON AVDD Channel Control
EMU_VMONDVDDCTRL EQU	0x098 		; VMON DVDD Channel Control
EMU_VMONIO0CTRL EQU	0x09C 		; VMON IOVDD0 Channel Control
EMU_RAM1CTRL 	EQU	0x0B4 		; Memory Control Register
EMU_RAM2CTRL 	EQU	0x0B8 		; Memory Control Register
EMU_DCDCLPEM01CFG EQU	0x0EC 		; Configuration Bits for Low Power Mode to Be Applied During EM01
EMU_EM23PERNORETAINCMD EQU 0x100 	; Clears Corresponding Bits in EM23PERNORETAINSTATUS 
EMU_EM23PERNORETAINSTATUS EQU 0x104 	; Status Indicating If Peripherals Were Powered Down in EM23
EMU_EM23PERNORETAINCTRL equ 0x108 	; When Set Corresponding Peripherals May Get Powered Down in EM23

