frogkim/storage/ARM assembly language/BlingBling/EFR32MG12.inc
	MACRO				; store word data in a given register
	PUTW	$wdata, $reg, $base
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF
	IF	$wdata <= 0xFF
	movs	R1, #$wdata
	ELIF	$wdata <= 0xFFFF
	movw	R1, #$wdata
	ELSE
	ldr	R1, =$wdata
	ENDIF
	str	R1, [R0, #$reg]	
	MEND

	MACRO				; store byte in a given register
	PUTB	$wdata, $reg, $base
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF		
	movs	R1, #$wdata	
	strb	R1, [R0, #$reg]
	MEND

	MACRO				; load a word into R1
	GETW	$reg, $base
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF			
	ldr	R1, [R0, #$reg]	
	MEND
		
	MACRO				; OR a word with data in memory
	OORW	$wdata, $reg, $base
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF
	IF	$wdata <= 0xFF
	movs	R2, #$wdata
	ELIF	$wdata <= 0xFFFF
	movw	R2, #$wdata
	ELSE
	ldr	R2, =$wdata
	ENDIF	
	ldr	R1, [R0, #$reg]
	orr	R1, R2
	str	R1, [R0, #$reg]
	MEND

	MACRO				; OR a halfword with data in memory
	OORH	$wdata, $reg, $base 
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF
	IF	$wdata <= 0xFF
	movs	R2, #$wdata
	ELSE	
	movw	R2, #$wdata
	ENDIF		
	ldrh	R1, [R0, #$reg]
	orr	R1, R2
	strh	R1, [R0, #$reg]
	MEND

	MACRO				; OR a byte with data in memory
	OORB	$wdata, $reg, $base
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF	
	ldrb	R1, [R0, #$reg]
	movs	R2, #$wdata
	strb	R1, [R0, #$reg]
	MEND	

	MACRO				; AND a word with data in memory
	ANDW	$wdata, $reg, $base
	IF	"$base" <> "" 
	ldr	R0, =$base
	ENDIF
	IF	$wdata <= 0xFF
	movs	R2, #$wdata
	ELIF	$wdata <= 0xFFFF
	movw	R2, #$wdata
	ELSE
	ldr	R2, =$wdata
	ENDIF	
	ldr	R1, [R0, #$reg]
	and	R1, R2
	str	R1, [R0, #$reg]
	MEND	
	
	PRESERVE8
	THUMB				; use thumb instruction set	

	END